tests/load/load-test.yml
config:
  target: 'http://localhost:8000'
  phases:
    - duration: 60
      arrivalRate: 10
      name: 'Warm up'
    - duration: 120
      arrivalRate: 50
      name: 'Ramp up load'
    - duration: 300
      arrivalRate: 100
      name: 'Sustained load'
    - duration: 60
      arrivalRate: 200
      name: 'Peak load'
  defaults:
    headers:
      Content-Type: 'application/json'

scenarios:
  - name: 'Health Check'
    weight: 20
    flow:
      - get:
          url: '/health'
          
  - name: 'Authentication Flow'
    weight: 30
    flow:
      - post:
          url: '/api/auth/register'
          json:
            name: 'Load Test User'
            email: 'loadtest{{ $randomInt(1, 10000) }}@example.com'
            password: 'LoadTest123!'
      - post:
          url: '/api/auth/login'
          json:
            email: 'loadtest{{ $randomInt(1, 10000) }}@example.com'
            password: 'LoadTest123!'
          capture:
            - json: '$.token'
              as: 'authToken'
      - get:
          url: '/api/auth/profile'
          headers:
            Authorization: 'Bearer {{ authToken }}'
            
  - name: 'API Documentation'
    weight: 20
    flow:
      - get:
          url: '/api-docs'
      - get:
          url: '/api-docs/swagger-ui.css'
      - get:
          url: '/api-docs/swagger-ui-bundle.js'
          
  - name: 'Static Assets'
    weight: 30
    flow:
      - get:
          url: '/health'
      - think: 1